const dotenv = require("dotenv").config();

const { Client, GatewayIntentBits } = require('discord.js');
const client = (module.exports = new Client({ intents: [131071] }));
const axios = require('axios');
const cheerio = require('cheerio');
const now = new Date(); // 현재 시간
const utcNow = now.getTime() + (now.getTimezoneOffset() * 60 * 1000); // 현재 시간을 utc로 변환한 밀리세컨드값
const koreaTimeDiff = 9 * 60 * 60 * 1000; // 한국 시간은 UTC보다 9시간 빠름(9시간의 밀리세컨드 표현)
const koreaNow = new Date(utcNow + koreaTimeDiff); // utc로 변환된 값을 한국 시간으로 변환시키기 위해 9시간(밀리세컨드)를 더함
const date = koreaNow;
const keepAlive = require('./server.js');

const getHtml = async (url) => {
  try {
    return await axios.get(url)
      .catch(function (error) {
    if (error.response) {
      // 요청이 이루어졌으며 서버가 2xx의 범위를 벗어나는 상태 코드로 응답했습니다.
      console.log(error.response.data);
      console.log(error.response.status);
      console.log(error.response.headers);
    }
    else if (error.request) {
      // 요청이 이루어 졌으나 응답을 받지 못했습니다.
      // `error.request`는 브라우저의 XMLHttpRequest 인스턴스 또는
      // Node.js의 http.ClientRequest 인스턴스입니다.
      console.log(error.request);
    }
    else {
      // 오류를 발생시킨 요청을 설정하는 중에 문제가 발생했습니다.
      console.log('Error', error.message);
    }
    console.log(error.config);
  });
  } catch (error) {
    console.error(error);
  }
};
//>>>>>>>>>>>>>>>>>>>>>>>>>>>추가된부분
//멜론
var melon = "";
var crawledMusic = []
const URL = `https://www.melon.com/chart/`;

axios.get(URL).then(res => {
  console.log(res.status)
  if (res.status == 200) {

    // empty array
    let crawledMusic = [];

    // res.data에 있는 tag를 cheerio로 검색하여 변수에 담기
    const $ = cheerio.load(res.data);
    const $musicList = $('#lst50');

    $musicList.each(function(i) {
      crawledMusic[i] = {
        title: $(this).find('#lst50 > td > div > div > div.ellipsis.rank01 > span > a').text().trim(),
        artist: $(this).find('#lst50 > td > div > div > div.ellipsis.rank02 > a').text()
      };
    });
    for (var i = 0; i < 50; i++) {
      // console.log("<<" + (i+1) + "위>>\n" + "제목 : " + crawledMusic[i].title + "\n가수 : " + crawledMusic[i].artist + "\n")
      melon = melon + (`${i + 1}위\n제목 : ${crawledMusic[i].title}\n가수 : ${crawledMusic[i].artist}\n\n`);
    }
  } else {
    console.log("server response error")
  }
})

// 점메추
// https://ko.wiktionary.org/wiki/분류:한국어_음식
var lunch = new Array("가락지빵", "가래떡", "가루우유", "가지나물", "간고등어", "간장", "갈비", "갈비탕", "감자튀기", "감자튀김", "강냉이", "강정", "개떡", "개장", "건빵", "겨울냉면", "경편", "계란", "계란덮밥", "계란말이", "고기", "고기겹빵", "고량소주", "고량주", "고로케", "고추가루", "고추장", "고춧가루", "곤밥", "골동반", "곰", "곰국", "공갈빵", "과자", "광동요리", "구멍국수", "구야시", "국", "국물", "국밥", "국수", "국수발", "국수오리", "국숫발", "규돈", "기름밥", "기름사탕", "김", "김밥", "김초밥", "김치", "김치찌개", "까까", "깍두기", "깨소금", "껌", "꼬부랑국수", "꿀", "꿀타래", "꿔바로우", "나박김치", "날김치", "날달걀", "날맥주", "냉라면", "냉면", "녹차", "다코야키", "단디", "단맛감", "단무지", "단물얼음", "단얼음", "달걀", "달걀덮밥", "달걀말이", "닭갈비", "닭강정", "닭개장", "닭고기", "닭고기덮밥", "닭꼬치", "닭튀김", "대굿국", "덮밥", "도넛", "도미빵", "돈가스", "동치미", "돼지고기", "돼지고기덮밥", "된장", "된장찌개", "두부", "디저트", "땅콩과자", "떡", "떡국", "떡꼬치", "떡볶이", "뜨더국", "라면", "라면떡볶이", "라면수프", "라바슈", "라볶이", "럼", "레모네이드", "레몬수", "마가린", "마른반찬", "마른오징어", "마멀레이드", "마요네즈", "마카로니", "마파두부", "막걸리", "막대사탕", "만두", "만두기", "맘마", "맥주", "머스터드", "머스터드소스", "먹거리", "면발", "묵", "문어빵", "물냉면", "미숫가루", "미음", "밀가루", "밀국수", "밀크커피", "바게트", "바비큐", "바삭과자", "박고지", "박하사탕", "반미", "밥", "밥감주", "배추김치", "배춧국", "백설탕", "백엽다", "백포도주", "버터", "보드카", "보르시", "보리밥", "보리차", "보릿가루", "보신탕", "보쌈김치", "볶음밥", "부대찌개", "부침개", "분유", "분탕", "불고기", "붕어빵", "브랜디", "블랙커피", "비빔", "비빔냉면", "비빔밥", "빙수", "빠다", "빵", "삐짜", "사이다", "사탕", "사탕가루", "삶은달걀", "삼각김밥", "삼겹살", "삼계탕", "삼두음", "삼정과", "삼합미음", "새우젓", "새우튀김", "샌드위치", "샐러드", "생강주", "생강즙", "생강차", "생김치", "생라면", "생맥주", "생선묵", "생선전", "생선회", "생황장", "샤실리크", "샴팡", "샴페인", "설고", "설고빵", "설기과자", "설기빵", "설탕", "셔벗", "셰이크", "소갈비", "소고기덮밥", "소금", "소만두", "소맥", "소면", "소불고기", "소시지", "소젖", "소주", "손자장", "손짜장", "송편", "송화다식", "송화밀수", "쇠고기", "쇠고기덮밥", "수란", "수타 자장", "수타 자장면", "수프", "순대", "순두부찌개", "술", "스빠게띠", "스시", "스테이크", "스파게티", "시리얼", "식빵", "식초", "식품", "식혜", "쌀", "쌀떡", "쌀라드", "쌈", "쌘드위치", "썩장", "아욱국", "아이스커피", "아이스크림", "알찌개", "알코올음료", "알탕", "압생트", "애기젖가루", "애피타이저", "야구르트", "약과", "양갱", "양고기", "양로쵈", "양식", "양장피", "어묵", "얼럭밥", "얼음과자", "얼음보숭이", "에스프레소", "여름냉면", "염소젖", "염장", "엿", "오니기리", "오렌지주스", "오르되브르", "오리알", "오미자차", "오색경단", "오야코동", "오징어덮밥", "오크로시카", "옥수수빵", "올리브유", "와사비", "와인", "왜간장", "요구르트", "우동", "우유", "위스키", "유부", "육개장", "육회", "음료", "이크라", "인삼차", "인절미", "일식", "자장", "자장면", "잡채", "잡탕밥", "장어덮밥", "잼", "적", "적포도주", "젓", "젓갈", "젖가공품", "조미료", "조식", "주먹밥", "주스", "죽", "중식", "쥐치포", "쥐포", "즉석요리", "지지개", "짜장", "짜장면", "짬뽕", "쨈", "쫄면", "찌개", "찐빵", "차", "찰밥", "청국장", "초밥", "초콜릿", "총각김치", "추탕", "치즈", "치킨", "카레", "카스텔라", "칵테일", "칼국", "칼국수", "캐비어", "커피", "컵라면", "케이크", "케첩", "코코아", "콘브레드", "콘플레이크", "콜라", "콩국수", "콩밥", "콩우유", "콩자반", "쿠키", "크래커", "크루아상", "크림", "크림빵", "크림수프", "타래떡", "타이야키", "탕수육", "토스트", "통구이", "통닭", "튀기", "튀김", "트르들로", "파김치", "파메산", "파스타", "파이", "파전", "팔보채", "팬케이크", "펠메니", "편", "평양냉면", "포도주", "폭탄주", "푸딩", "푸른차", "풍선껌", "프라이", "프라이드치킨", "프렌치프라이", "플로프", "피자", "피짜", "필래프", "한식", "함박스테이크", "핫도그", "햄버거", "햄버거스테이크", "햄버그스테이크", "허니머스터드소스", "호떡", "홍차", "회", "회덮밥", "후무스", "후식");
var num = (Math.floor((Math.random() * 10000))) % 400;
console.log(lunch[num]);

// 셔틀
var h = date.getHours();

var t7 = ["7:50"];
var t8 = ["8:00", "8:10", "8:15", "8:20", "8:23", "8:26", "8:29", "8:32", "8:35", "8:38", "8:41", "8:44", "8:47", "8:50", "8:55"];
var t9 = ["9:00", "9:05", "9:10", "9:15", "9:20", "9:23", "9:26", "9:29", "9:32", "9:35", "9:38", "9:41", "9:44", "9:47", "9:50", "9:55"];
var t10 = ["10:00", "10:05", "10:10", "10:15", "10:20", "10:25", "10:30", "10:40", "10:50"];
var t11 = ["11:00", "11:15", "11:30", "11:45"];
var t12 = ["12:00", "12:10", "12:20", "12:25", "12:30", "12:40", "12:50"];
var t13 = ["13:00", "13:15", "13:30", "13:45"];
var t14 = ["14:00", "14:15", "14:25", "14:35", "14:45"];
var t15 = ["15:00", "15:10", "15:20", "15:30", "15:40", "15:50"];
var t16 = ["16:00", "16:06", "16:12", "16:18", "16:24", "16:30", "16:36", "16:42", "16:48", "16:54"];
var t17 = ["17:00", "17:06", "17:12", "17:18", "17:24", "17:30", "17:36", "17:42", "17:48", "17:54"];
var t18 = ["18:00", "18:06", "18:12", "18:18", "18:24", "18:30", "18:40", "18:50"];
var t19 = ["19:00", "19:10", "19:20", "19:30", "19:40", "19:50"];
var t20 = ["20:00", "20:10", "20:20", "20:30", "20:40", "20:50"];
var t21 = ["21:00", "21:10", "21:20", "21:30", "21:45"];
var t22 = ["22:00", "22:15", "22:30", "22:40", "22:50"];
var t23 = ["23:00"];

var arr = [t7, t8, t9, t10, t11, t12, t13, t14, t15, t16, t17, t18, t19, t20, t21, t22, t23];
//>>>>>>>>>>>>>>>>>>>>>>>>>>>>추가ㅣ


// discord 봇이 실행될 때 딱 한 번 실행할 코드를 적는 부분
client.once('ready', () => {
  client.user.setActivity('opensourcebot', { type: 'WATCHING' })
  console.log('Ready!');
});


// 디스코드 서버에 작성되는 모든 메시지를 수신하는 리스너
client.on("messageCreate", (message) => {
  if ((message.content == "안녕") || (message.content == "hi")) {
    message.reply({ content: `안녕하세요` });
  }
  if (message.content == "지금 몇시야" || message.content == "몇시" || message.content == "time") {
    message.reply({ content: (date.toLocaleString('ko-kr')) });
  }
  // 학식 정보 출력
  if (message.content == "오늘학식" || message.content == "학식" || message.content == "ㅎㅅ" || message.content == "학생식당") {
    getHtml('https://www.hanyang.ac.kr/web/www/re12')
      .then((html) => {
        const $ = cheerio.load(html.data);
        const data = {
          //첫번째 학식
          mainContents: $('#messhall1 > div:nth-child(1) > div > div > div > ul > li:nth-child(1) > a > h3')
            .text()
            .replace(/[\n\t\&amp;]/g, ''),
          //두번째 학식
          secondContents: $('#messhall1 > div:nth-child(1) > div > div > div > ul > li:nth-child(2) > a > h3')
            .text()
            .replace(/[\n\t\&amp;]/g, ''),
          //공통찬
          thirdContents: $('#messhall1 > div:nth-child(2) > table')
            .text()
            .replace(/[\n\t\&amp;\공통찬]/g, '')
          ,
        };
        if (data.mainContents == '') {
          data.mainContents = "오늘은 학식이 없습니다.";
          data.secondContents = "오늘은 학식이 없습니다.";
        }
        return data;
      }) //학식, 공통찬 출력
      .then((res) => message.reply({ content: ("(학식1) 운영시간 : 11:30 ~ 13:30\n" + res.mainContents + "\n" + res.secondContents + "\n[공통] " + res.thirdContents) }));

  }
  if (message.content == "교직" || message.content == "교식" || message.content == "교직원식" || message.content == "ㄱㅈ" || message.content == "교직원식당") {
    getHtml('https://www.hanyang.ac.kr/web/www/re11')
      .then((html) => {
        const $ = cheerio.load(html.data);
        const data = {
          //첫번째 교식
          mainContents: $('#messhall1 > div:nth-child(1) > div > div > div > ul > li:nth-child(1) > a > h3')
            .text()
            .replace(/[\n\t]/g, '')
            .replace(/[*]/g, ' '),
        };
        if (data.mainContents == '') {
          data.mainContents = "오늘은 교식이 없습니다.";
        }
        return data;
      }) //학식, 공통찬 출력
      .then((res) => message.reply({ content: ("(교직원 식당) 운영시간 : 11:30 ~ 13:30\n" + res.mainContents) }));

  }
  if (message.content == "기숙사식당" || message.content == "긱식" || message.content == "오늘기식" || message.content == "기식" || message.content == "ㄱㅅ" || message.content == "창의인재원식당") {
    getHtml('https://www.hanyang.ac.kr/web/www/re13')
      .then((html) => {
        const $ = cheerio.load(html.data);
        const data = {
          //조식
          firstContents: $('#messhall1 > div:nth-child(1) > div > div > div > ul > li > a > h3')
            .text()
            .replace(/[\n\t]/g, '')
            .replace(/[\[특식\]]/g, ''),
          //중식1
          secondContents: $('#messhall1 > div:nth-child(2) > div > div > div > ul > li:nth-child(1) > a > h3')
            .text()
            .replace(/[\n\t]/g, '')
            .replace(/[\[특식\]]/g, ''),
          //중식2
          thirdContents: $('#messhall1 > div:nth-child(2) > div > div > div > ul > li:nth-child(2) > a > h3')
            .text()
            .replace(/[\n\t]/g, '')
            .replace(/[\[특식\]]/g, ''),
          // 석식
          forthContents: $('#messhall1 > div:nth-child(3) > div > div > div > ul > li > a > h3')
            .text()
            .replace(/[\n\t]/g, '')
            .replace(/[\[특식\]]/g, '')
          ,
        };
        if (data.firstContents == '') {
          data.firstContents = "오늘은 조식이 없습니다.";
        }
        else if (data.secondContents == '') {
          data.secondContents = "오늘은 중식 A 이/가 없습니다."
        }
        else if (data.thirdContents == '') {
          data.thirdContents = "오늘은 중식 B 이/가 없습니다."
        }
        else if (data.forthContents == '') {
          data.forthContents = "오늘은 석식이 없습니다."
        }
        return data;
      }) //학식, 공통찬 출력
      .then((res) => message.reply({ content: ("(창의인재원 식당)\n[조식 07:40~09:00]\n" + res.firstContents + "\n[중식 A 11:30~13:20]\n" + res.secondContents + "\n[중식 B 11:30~13:20]\n" + res.thirdContents + "\n[석식 17:10~18:40]\n" + res.forthContents) }));

  }

  //>>>>>>>>>>>추가
  if (message.content == "지금 몇시야" || message.content == "몇시" || message.content == "time") {
    message.reply({ content: (date.toLocaleString('ko-kr')) });
  }
  if ((message.content == "멜론") || (message.content == "음악") || (message.content == "차트")) {
    message.reply({ content: (melon) });
  }
  if ((message.content == "점메추") || (message.content == "점심") || (message.content == "뭐먹지")) {
    var lunch = new Array("가락지빵", "가래떡", "가루우유", "가지나물", "간고등어", "간장", "갈비", "갈비탕", "감자튀기", "감자튀김", "강냉이", "강정", "개떡", "개장", "건빵", "겨울냉면", "경편", "계란", "계란덮밥", "계란말이", "고기", "고기겹빵", "고량소주", "고량주", "고로케", "고추가루", "고추장", "고춧가루", "곤밥", "골동반", "곰", "곰국", "공갈빵", "과자", "광동요리", "구멍국수", "구야시", "국", "국물", "국밥", "국수", "국수발", "국수오리", "국숫발", "규돈", "기름밥", "기름사탕", "김", "김밥", "김초밥", "김치", "김치찌개", "까까", "깍두기", "깨소금", "껌", "꼬부랑국수", "꿀", "꿀타래", "꿔바로우", "나박김치", "날김치", "날달걀", "날맥주", "냉라면", "냉면", "녹차", "다코야키", "단디", "단맛감", "단무지", "단물얼음", "단얼음", "달걀", "달걀덮밥", "달걀말이", "닭갈비", "닭강정", "닭개장", "닭고기", "닭고기덮밥", "닭꼬치", "닭튀김", "대굿국", "덮밥", "도넛", "도미빵", "돈가스", "동치미", "돼지고기", "돼지고기덮밥", "된장", "된장찌개", "두부", "디저트", "땅콩과자", "떡", "떡국", "떡꼬치", "떡볶이", "뜨더국", "라면", "라면떡볶이", "라면수프", "라바슈", "라볶이", "럼", "레모네이드", "레몬수", "마가린", "마른반찬", "마른오징어", "마멀레이드", "마요네즈", "마카로니", "마파두부", "막걸리", "막대사탕", "만두", "만두기", "맘마", "맥주", "머스터드", "머스터드소스", "먹거리", "면발", "묵", "문어빵", "물냉면", "미숫가루", "미음", "밀가루", "밀국수", "밀크커피", "바게트", "바비큐", "바삭과자", "박고지", "박하사탕", "반미", "밥", "밥감주", "배추김치", "배춧국", "백설탕", "백엽다", "백포도주", "버터", "보드카", "보르시", "보리밥", "보리차", "보릿가루", "보신탕", "보쌈김치", "볶음밥", "부대찌개", "부침개", "분유", "분탕", "불고기", "붕어빵", "브랜디", "블랙커피", "비빔", "비빔냉면", "비빔밥", "빙수", "빠다", "빵", "삐짜", "사이다", "사탕", "사탕가루", "삶은달걀", "삼각김밥", "삼겹살", "삼계탕", "삼두음", "삼정과", "삼합미음", "새우젓", "새우튀김", "샌드위치", "샐러드", "생강주", "생강즙", "생강차", "생김치", "생라면", "생맥주", "생선묵", "생선전", "생선회", "생황장", "샤실리크", "샴팡", "샴페인", "설고", "설고빵", "설기과자", "설기빵", "설탕", "셔벗", "셰이크", "소갈비", "소고기덮밥", "소금", "소만두", "소맥", "소면", "소불고기", "소시지", "소젖", "소주", "손자장", "손짜장", "송편", "송화다식", "송화밀수", "쇠고기", "쇠고기덮밥", "수란", "수타 자장", "수타 자장면", "수프", "순대", "순두부찌개", "술", "스빠게띠", "스시", "스테이크", "스파게티", "시리얼", "식빵", "식초", "식품", "식혜", "쌀", "쌀떡", "쌀라드", "쌈", "쌘드위치", "썩장", "아욱국", "아이스커피", "아이스크림", "알찌개", "알코올음료", "알탕", "압생트", "애기젖가루", "애피타이저", "야구르트", "약과", "양갱", "양고기", "양로쵈", "양식", "양장피", "어묵", "얼럭밥", "얼음과자", "얼음보숭이", "에스프레소", "여름냉면", "염소젖", "염장", "엿", "오니기리", "오렌지주스", "오르되브르", "오리알", "오미자차", "오색경단", "오야코동", "오징어덮밥", "오크로시카", "옥수수빵", "올리브유", "와사비", "와인", "왜간장", "요구르트", "우동", "우유", "위스키", "유부", "육개장", "육회", "음료", "이크라", "인삼차", "인절미", "일식", "자장", "자장면", "잡채", "잡탕밥", "장어덮밥", "잼", "적", "적포도주", "젓", "젓갈", "젖가공품", "조미료", "조식", "주먹밥", "주스", "죽", "중식", "쥐치포", "쥐포", "즉석요리", "지지개", "짜장", "짜장면", "짬뽕", "쨈", "쫄면", "찌개", "찐빵", "차", "찰밥", "청국장", "초밥", "초콜릿", "총각김치", "추탕", "치즈", "치킨", "카레", "카스텔라", "칵테일", "칼국", "칼국수", "캐비어", "커피", "컵라면", "케이크", "케첩", "코코아", "콘브레드", "콘플레이크", "콜라", "콩국수", "콩밥", "콩우유", "콩자반", "쿠키", "크래커", "크루아상", "크림", "크림빵", "크림수프", "타래떡", "타이야키", "탕수육", "토스트", "통구이", "통닭", "튀기", "튀김", "트르들로", "파김치", "파메산", "파스타", "파이", "파전", "팔보채", "팬케이크", "펠메니", "편", "평양냉면", "포도주", "폭탄주", "푸딩", "푸른차", "풍선껌", "프라이", "프라이드치킨", "프렌치프라이", "플로프", "피자", "피짜", "필래프", "한식", "함박스테이크", "핫도그", "햄버거", "햄버거스테이크", "햄버그스테이크", "허니머스터드소스", "호떡", "홍차", "회", "회덮밥", "후무스", "후식");
    var num = (Math.floor((Math.random() * 10000))) % 400;
    message.reply({ content: (lunch[num]) });
  }
  if ((message.content == "집") || (message.content == "셔틀") || (message.content == "언제와")) {
    var timetable = "";
    for (var i = 0; i <= 24; i++) {
      if ((i == h - 7) || (i == h - 6)) {
        var len = arr[i].length;
        for (var j = 0; j < len; j++) {
          timetable = timetable + arr[i][j] + "\n";
        }
      }
    }
    message.reply({ content: ("셔틀시간표 2시간치") });
    message.reply({ content: (timetable) });
  }
  // >>>>>>>>>>>.추가
});
keepAlive();
// 봇과 서버를 연결해주는 부분
client.login(process.env['TOKEN']);